In [1]:
import pandas as pd
import numpy as np

In [5]:
s = pd.Series([1,2,3,4])
df = pd.DataFrame(s)
df

   0
0  1
1  2
2  3
3  4

In [8]:
name = pd.Series(["Amlan","Anshuman","Aman"])
slno = pd.Series([25,12,1])
dic = {"Name":name,"Serial No":slno,"Regd No":[234,101,451]}
df = pd.DataFrame(dic)
df

       Name  Serial No  Regd No
0     Amlan         25      234
1  Anshuman         12      101
2      Aman          1      451

### DataFrame from list of Dictionaries

In [17]:
dic1 = [{"FirstName":"Amlan","LastName":"Nayak","Age":21},
       {"FirstName":"Abhipsa","LastName":"Mohapatra","Age":12},
       {"FirstName":"ABC","LastName":"DEF","Age":25}]
df2 = pd.DataFrame(dic1)
df2[["FirstName","Age"]]

  FirstName  Age
0     Amlan   21
1   Abhipsa   12
2       ABC   25

### Iteration on rows and cols
##### 1. iterrows(): for rows
##### 2. items(): for cols

In [20]:
for (row_index,row_value) in df2.iterrows():
    print("\nRow Index:",row_index)
    print("Row Value:")
    print(row_value)

Row Index: 0
Row Value:
FirstName    Amlan
LastName     Nayak
Age             21
Name: 0, dtype: object

Row Index: 1
Row Value:
FirstName      Abhipsa
LastName     Mohapatra
Age                 12
Name: 1, dtype: object

Row Index: 2
Row Value:
FirstName    ABC
LastName     DEF
Age           25
Name: 2, dtype: object

In [21]:
for (col_index,col_value) in df2.items():
    print("\nColumn Index:",col_index)
    print("Column Value:")
    print(col_value)

Column Index: FirstName
Column Value:
0      Amlan
1    Abhipsa
2        ABC
Name: FirstName, dtype: object

Column Index: LastName
Column Value:
0        Nayak
1    Mohapatra
2          DEF
Name: LastName, dtype: object

Column Index: Age
Column Value:
0    21
1    12
2    25
Name: Age, dtype: int64

### Employee

In [25]:
companies = ["ABC","DEF","XYZ"]
names = ["Amlan","Aman","Anshuman"]
doj = ["12/02/2025","10/05/2025","25/08/2025"]
empData= {"Company":companies,
          "Name":names,
          "Date Of Joining":doj}
empDf = pd.DataFrame(empData) 
empDf

  Company      Name Date Of Joining
0     ABC     Amlan      12/02/2025
1     DEF      Aman      10/05/2025
2     XYZ  Anshuman      25/08/2025

In [28]:
empDf["Company"]

0    ABC
1    DEF
2    XYZ
Name: Company, dtype: object

In [29]:
empDf.Company

0    ABC
1    DEF
2    XYZ
Name: Company, dtype: object

In [32]:
empDf[["Company","Name"]]

  Company      Name
0     ABC     Amlan
1     DEF      Aman
2     XYZ  Anshuman

### Adding and renaming columns

In [33]:
s = pd.Series([1,2,3,4])
df3 = pd.DataFrame(s)
df3

   0
0  1
1  2
2  3
3  4

In [34]:
df3.columns = ['List1']
df3

   List1
0      1
1      2
2      3
3      4

In [35]:
#studentdata
names = ["S1","S2","S3"]
marks_in_python = [50,51,52]
marks_in_MLC = [60,61,62]
stdData = pd.DataFrame({"Name":names,"Python":marks_in_python,"MLC":marks_in_MLC})
stdData

  Name  Python  MLC
0   S1      50   60
1   S2      51   61
2   S3      52   62

In [37]:
stdData['Total'] = stdData['Python']+stdData['MLC']
stdData

  Name  Python  MLC  Total
0   S1      50   60    110
1   S2      51   61    112
2   S3      52   62    114

In [41]:
stdData.rename(columns = {"Total":"Total Marks"},inplace=True)
stdData

  Name  Python  MLC  Total Marks
0   S1      50   60          110
1   S2      51   61          112
2   S3      52   62          114

In [42]:
### 1.del , 2.pop(), 3.drop()

   List1
0      1
1      2
2      3
3      4

In [48]:
l1 = [1,2,3,4]
l2 = [5,6,7,8]
l3 = [9,10,11,12]

lsData = pd.DataFrame({"List1":l1,"List2":l2,"List3":l3})
lsData

   List1  List2  List3
0      1      5      9
1      2      6     10
2      3      7     11
3      4      8     12

In [49]:
del lsData["List3"]
lsData

   List1  List2
0      1      5
1      2      6
2      3      7
3      4      8

In [50]:
print(lsData.pop("List2"))

0    5
1    6
2    7
3    8
Name: List2, dtype: int64

In [52]:
l1 = [1,2,3,4]
l2 = [5,6,7,8]
l3 = [9,10,11,12]

lsData = pd.DataFrame({"List1":l1,"List2":l2,"List3":l3})
lsData

   List1  List2  List3
0      1      5      9
1      2      6     10
2      3      7     11
3      4      8     12

In [54]:
lsData.drop(index=[0,1],axis=1) #it will delete the rows rather than the columns

   List1  List2  List3
2      3      7     11
3      4      8     12

In [55]:
lsData.drop(columns=["List1","List2"],axis=1) #it will delete the columns

   List3
0      9
1     10
2     11
3     12

In [56]:
Runs = {"TCS":{"Qtr1":2500,"Qtr2":2000,"Qtr3":3000,"Qtr4":2000},
       "WIPRO":{"Qtr1":2800,"Qtr2":2400,"Qtr3":3600,"Qtr4":2400},
       "L&T":{"Qtr1":2100,"Qtr2":5700,"Qtr3":35000,"Qtr4":2100}}
rndf = pd.DataFrame(Runs)
rndf

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000
Qtr4  2000   2400   2100

In [61]:
rndf.loc["Qtr1",:]

TCS      2500
WIPRO    2800
L&T      2100
Name: Qtr1, dtype: int64

In [66]:
rndf.loc["Qtr1":"Qtr2",:]

       TCS  WIPRO   L&T
Qtr1  2500   2800  2100
Qtr2  2000   2400  5700

In [63]:
rndf.loc[:,"TCS"]

Qtr1    2500
Qtr2    2000
Qtr3    3000
Qtr4    2000
Name: TCS, dtype: int64

In [78]:
rndf.loc[:,"TCS":"L&T"]

       TCS  WIPRO    L&T
Qtr1  2500   2800   2100
Qtr2  2000   2400   5700
Qtr3  3000   3600  35000
Qtr4  2000   2400   2100

In [81]:
rndf.iloc[:,0:2]#[row slicing,col slicing]

       TCS  WIPRO
Qtr1  2500   2800
Qtr2  2000   2400
Qtr3  3000   3600
Qtr4  2000   2400

In [84]:
companies = ["ABC","DEF","XYZ","ARD","AAA","BBB","CCC"]
names = ["Amlan","Aman","Anshuman","emp1","emp2","emp3","emp4"]
doj = ["12/02/2025","10/05/2025","25/08/2025","12/02/2025","10/05/2025","25/08/2025","25/08/2025"]
empData= {"Company":companies,
          "Name":names,
          "Date Of Joining":doj}
empDf = pd.DataFrame(empData) 
empDf

  Company      Name Date Of Joining
0     ABC     Amlan      12/02/2025
1     DEF      Aman      10/05/2025
2     XYZ  Anshuman      25/08/2025
3     ARD      emp1      12/02/2025
4     AAA      emp2      10/05/2025
5     BBB      emp3      25/08/2025
6     CCC      emp4      25/08/2025

In [85]:
empDf.loc[0]

Company                   ABC
Name                    Amlan
Date Of Joining    12/02/2025
Name: 0, dtype: object

In [86]:
empDf.loc[0:2]

  Company      Name Date Of Joining
0     ABC     Amlan      12/02/2025
1     DEF      Aman      10/05/2025
2     XYZ  Anshuman      25/08/2025

In [87]:
empDf.iloc[0:2]

  Company   Name Date Of Joining
0     ABC  Amlan      12/02/2025
1     DEF   Aman      10/05/2025

In [88]:
empDf.iloc[0]

Company                   ABC
Name                    Amlan
Date Of Joining    12/02/2025
Name: 0, dtype: object

In [91]:
empDf.head()

  Company      Name Date Of Joining
0     ABC     Amlan      12/02/2025
1     DEF      Aman      10/05/2025
2     XYZ  Anshuman      25/08/2025
3     ARD      emp1      12/02/2025
4     AAA      emp2      10/05/2025

In [90]:
empDf.tail()

  Company      Name Date Of Joining
2     XYZ  Anshuman      25/08/2025
3     ARD      emp1      12/02/2025
4     AAA      emp2      10/05/2025
5     BBB      emp3      25/08/2025
6     CCC      emp4      25/08/2025

### Accessing a specific DataFrame cell by row and column

In [3]:
marks = pd.DataFrame({
    "s1":[10,20,30,40,50],
    "s2":[50,40,30,20,10],
    "s3":[60,70,80,90,100],
    "s4":[100,90,80,70,60]
},index=["T01","T02","T03","T04","T05"])

marks

     s1  s2   s3   s4
T01  10  50   60  100
T02  20  40   70   90
T03  30  30   80   80
T04  40  20   90   70
T05  50  10  100   60

#### Accessing s1's T01 marks

In [6]:
#method1
marks["s1"]["T01"] #[col][row]

10

In [8]:
#method2
marks.s1.T01 #col.row

10

In [10]:
#method3
marks.at["T01","s1"]#[row][col]

10

In [13]:
marks.iat[0,0] #[row][col] in integer

10

In [15]:
#O grade students:
print(marks>=90)

        s1     s2     s3     s4
T01  False  False  False   True
T02  False  False  False   True
T03  False  False  False  False
T04  False  False   True  False
T05  False  False   True  False

In [16]:
print(marks[marks>=90])

     s1  s2     s3     s4
T01 NaN NaN    NaN  100.0
T02 NaN NaN    NaN   90.0
T03 NaN NaN    NaN    NaN
T04 NaN NaN   90.0    NaN
T05 NaN NaN  100.0    NaN

In [19]:
print(marks[(marks<90) & (marks>=80)]) 
# in pandas and is &, or is | , not is ~

     s1  s2    s3    s4
T01 NaN NaN   NaN   NaN
T02 NaN NaN   NaN   NaN
T03 NaN NaN  80.0  80.0
T04 NaN NaN   NaN   NaN
T05 NaN NaN   NaN   NaN

### Interchanging rows and columns

In [20]:
marks

     s1  s2   s3   s4
T01  10  50   60  100
T02  20  40   70   90
T03  30  30   80   80
T04  40  20   90   70
T05  50  10  100   60

In [24]:
#Interchanging
tMarks = marks.T #transpose marks
tMarks

    T01  T02  T03  T04  T05
s1   10   20   30   40   50
s2   50   40   30   20   10
s3   60   70   80   90  100
s4  100   90   80   70   60

In [26]:
tMarks.T01.s1

10

### Sorting

In [27]:
#sort by row indices(Descending order)
marks.sort_index(ascending=False)

     s1  s2   s3   s4
T05  50  10  100   60
T04  40  20   90   70
T03  30  30   80   80
T02  20  40   70   90
T01  10  50   60  100

In [28]:
#sort by col indices(Ascending order)
marks.sort_index(axis=1)

     s1  s2   s3   s4
T01  10  50   60  100
T02  20  40   70   90
T03  30  30   80   80
T04  40  20   90   70
T05  50  10  100   60

In [29]:
#sort by col indices(Descending order)
marks.sort_index(axis=1, ascending=False)

      s4   s3  s2  s1
T01  100   60  50  10
T02   90   70  40  20
T03   80   80  30  30
T04   70   90  20  40
T05   60  100  10  50

In [42]:
marks.sort_values(by=['T01'],axis=1,ascending='False')

     s1  s2   s3   s4
T01  10  50   60  100
T02  20  40   70   90
T03  30  30   80   80
T04  40  20   90   70
T05  50  10  100   60

In [39]:
marks.sort_values(by=['T02'],axis=1,ascending='False')

     s1  s2   s3   s4
T01  10  50   60  100
T02  20  40   70   90
T03  30  30   80   80
T04  40  20   90   70
T05  50  10  100   60